#Guardar la configuración en ejecución del router en la conf de inicio.
copy running-config startup-config
#Guardar conf
copy run start

#Modo privilegiado 
enable
disable // exit

#Configurar
config t // config #y luego (enter)    

#ayuda (empieza con)
con?

#Comandos show
show running-config
show interfaces
show arp
show ip route
show users
show version

#Interfaces
show ip interface brief
show interface XNOMBREX 0/0

#Nombre dispositivo (Dentro de config)
hostname XNOMBREX

#Contraseña EXEC privilegiado (Dentro de config)
enable password XPASSX #No encriptada
enable secret XPASSX	#Encriptada

#Evitar que usuarios no autorizados accedan al modo usuario desde el puerto de consola
Router(config)# line console 0
Router(config‐line)# password XPASSX
Router(config‐line)# login

#Contraseña para el puerto virtual acceso mediante red
Router(config)# line vty 0 4
Router(config‐line)# password XPASSX      
Router(config‐line)# login

#Verificar contraseñas
show running-config

#Encriptar todas las contraseñas
Router(config)# service password-encryption

#Configurar interface serial
Router(config)# interface serial 0/0
Router(config-if)# description connection to Router 2
Router(config-if)# ip address 192.168.1.125 255.255.255.0
Router(config-if)# clock rate 64000
Router(config-if)# no shutdown

#Verificar interfaces
show ip interface brief
show ip route #Tabla de enrutamiento
show interfaces
show ip interface

CONFIGURACION RUTA ESTATICA
Router(config)# ip route [dir red] [máscara] [dir siguiente salto // interfaz salida]

CONFIG RUTA PREDETERMINADA
Router(config)# ip route 0.0.0.0 0.0.0.0 [dir siguiente salto // interfaz salida]

CONFIGURACION RIPv1
Router(config)#router rip
Router(config-router)#network [network-number]

CONFIGURACION RIPv2
Router(config)#router rip
Router(config-router)#version 2
Router(config-router)#network [network-number]

DESHABILITAR SUMARIZACIÓN AUTOMÁTICA
Router(config-router)#no auto-summary


############################### NAT ###############################
                                                                  #
######## NAT ESTÁTICA #############################################
                                                                  #
Router(config)# ip nat inside source static [IP-LOCAL][IP-GLOBAL] # 
                                                                  #
ELIMINAR NAT ESTÁTICA                                             #
Router(config)# no ip nat inside source static                    #
                                                                  #
	INTERFAZ INTERNA                                          #
	Router(config)# interface [NUMBER]                        #
	Router(config-if)# ip nat inside                          #
                                                                  #
	INTERFAZ EXTERNA                                          #
        Router(config)#interface [NUMBER]                         #
        Router(config-if)# ip nat outside                         #
                                                                  #
        VERIFICAR TRADUCCIONES NAT ACTIVAS                        #
        Router# show ip nat translations                          #
                                                                  #
        INFORMACIÓN ESTADISTICAS NAT (Borrar antes)               #
	Router# clear ip nat statistics                           #
        Router# show ip nat statistics                            #
                                                                  #
######## NAT DINAMICA #############################################
                                                                  #
Router(config)# ip nat pool NAME FIRST-IP LAST-IP                 #
		{netmask MASK | prefix-length LENGTH}             #
		(Ejemplo: ip nat pool NAT-POOL1 209.165.200.226   #
		209.165.200.240 netmask 255.255.255.224) EXTERNA  #
                                                                  #
                                                                  #
	LISTA DE ACCESO                                           #
        Router(config)# access-list NUMBER permit ORIGIN          #
	(Ejemplo: access-list 1 permit 192.168.0.0 0.0.255.255    #
		INTERNA						  #
                                                                  #
        ESPECIFICAR LISTA DE ACCESO                               #
        Router(config)# ip nat inside source list NUMBER          #
                        pool NAME                                 #
                                                                  #
        INTERFAZ INTERNA                                          #
        Router(config)# interface [NUMBER]                        #
        Router(config-if)# ip nat inside                          #
                                                                  #
        INTERFAZ EXTERNA                                          #
        Router(config)# interface [NUMBER]                        #
        Router(config-if)# ip nat outside                         #
                                                                  #
        VERIFICAR TRADUCCIONES NAT ACTIVAS                        #
        Router# show ip nat translations                          #
                                                                  #
        VERIFICAR E INFORMACION ADICIONAL                         #
        Router# show ip nat translation verbose                   #
	                                                          #
	BORRAR ENTRADAS                                           #
        Router# clear ip nat translation *                        #
                                                                  #
	TEMPORIZADOR						  #
	Router(config)# ip nat translation timeout SECONDS	  #
                                                                  #
        INFORMACIÓN ESTADISTICAS NAT (Borrar antes)               #
        Router# clear ip nat statistics                           #
        Router# show ip nat statistics                            #
                                                                  #
######## NAT CON SOBRECARGA (PAT) #################################
                                                                  #
Router(config)# ip nat pool NAME FIRST-IP LAST-IP                 #
		{netmask MASK | prefix-length LENGTH}             #
                                                                  #
        LISTA DE ACCESO                                           #
        Router(config)# access-list NUMBER permit ORIGIN          #
								  #
        ESPECIFICAR LISTA DE ACCESO                               #
        Router(config)# ip nat inside source list NUMBER          #
                        pool NAME overload                        #
                                                                  #
        INTERFAZ INTERNA                                          #
        Router(config)# interface [NUMBER]                        #
        Router(config-if)# ip nat inside                          #
                                                                  #
        INTERFAZ EXTERNA                                          #
        Router(config)# interface [NUMBER]                        #
        Router(config-if)# ip nat outside                         #
                                                                  #
        ESPECIFICAR LISTA DE ACCESO (UNICA IPv4)                  #
        Router(config)# ip nat inside source list NUMBER          #
                                                                  #
        VERIFICAR TRADUCCIONES NAT ACTIVAS                        #
        Router# show ip nat translations                          #
                                                                  #
        VERIFICAR E INFORMACION ADICIONAL                         #
        Router# show ip nat translation verbose                   #
                                                                  #
        BORRAR ENTRADAS                                           #
        Router# clear ip nat translation *                        #
                                                                  #
        TEMPORIZADOR                                              #
        Router(config)# ip nat translation timeout SECONDS        #
                                                                  #
        INFORMACIÓN ESTADISTICAS NAT (Borrar antes)               #
        Router# clear ip nat statistics                           #
        Router# show ip nat statistics                            #
###################################################################
######## CONMUTACION #############################################

Crear VLAN
S1(config)# vlan ID_XX
S1(config-vlan)# name NOMBRE_XX
S1(config-vlan)# exit

###########Configurar la interfaz de administracion
Configurar interfaz para la SVI
S1(config)# interface vlan XX
Configurar  direccion ip
S1(config-if)# ip address 172.17.99.11 255.255.0.0
Habilitarla
S1(config-if)# no shutdown
Volver al modo EXEC
S1(config-if)# end
S1# copy running-config startup-config

Agregar interfaces a VLAN
S1(config)# interface interface_ID (range f0/1 - 24, g0/1-2)
S1(config-if)# switchport access vlan ID_XX

###########Configuracion del gateway predeterminado
S1(config)# ip default-gateway
S1(config)# end

###########Verificar la configuracion
S1# show ip interface brief
S1# show vlan brief
S1# show interface VLAN XX
S1# show vlan

###########Evitar las busquedas de DNS no deseadas
S1(config)# no ip domain-lookup

###########Configurar Mensaje MOTD
S1(config)# banner motd #

###########Evitar que los mensajes interrumpan comandos
S1(config)# line con 0
S1(config-line)# password XX
S1(config-line)# login
S1(config-line)# logging synchronous
S1(config-line)# exit

###########Acceso telnet
S1(config)# line vty 0 15
S1(config-line)# password XX
S1(config-line)# login
S1(config-line)# end

###########Eliminar archivo VLAN almacenado en switches
delete vlan.dat

###########Configurar enlaces troncales
S1(config)# int Fa0/1
S1(config-if)# switchport mode trunk
S1(config-if)# END

S1# show interfaces trunk

#Quitarlo
S1(config-if)# no switchport mode trunk

#Verificar configuraciones del router y switches
show spanning-tree

#COnfigurar el enlace trocal de la VLAN en el router
VLAN1
R1(config)# interface fa0/0
R1(config-if)# no shutdown
R1(config-if)# interface fa0/0.1
R1(config-subif)# encapsulation dot1Q 1
R1(config-subif)# ip address 172.16.1.1 255.255.255.0
R1(config-subif)# exit

VLAN10
R1(config)# interface fa0/0, 10
R1(config-if)# no shutdown
R1(config-if)# interface fa0/0.1
R1(config-subif)# encapsulation dot1Q 1
R1(config-subif)# ip address 172.16.10.1 255.255.255.0
R1(config-subif)# exit    

#Configurar Switch con interfaces para VLAN
R1(config)# interface fa0/7
R1(config-if)# switchport mode access
R1(config-if)# switchport access vlan 20
R1(config-if)# exit


#Configurar vtp en el switch
S1(config)# vtp domain Group1
S1(config)# vtp mode server  # server | client | transparent
S1(config)# vtp password password
S1(config)# end
